ОптоваяТорговля/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтгрузки</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОптоваяТорговля/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	СтрокаТабЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСуммуСтроки(СтрокаТабЧасти);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТабЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСуммуСтроки(СтрокаТабЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Цена = ЦеныНоменклатурыВызовСервера.ЦенаНоменклатуры(
		ТекущиеДанные.Номенклатура, Объект.Организация, Объект.Дата);
			
	ТекущиеДанные.Цена = Цена;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(ВыбранноеЗначение) Тогда
		ЗаполнитьИзКорзины(ВыбранноеЗначение);
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтчетПоОстаткам(Команда)
	
	ОтборНоменклатура = Новый Массив;
	Для Каждого Строка Из Объект.СписокНоменклатуры Цикл
		ОтборНоменклатура.Добавить(Строка.Номенклатура);
	КонецЦикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", ОтборНоменклатура);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ОстаткиТоваров.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Подбор(Команда)
	
	Если ЗначениеЗаполнено(Объект.СписокНоменклатуры) Тогда
		Ответ = Ждать ВопросАсинх(
			"После завершения подбора текущие данные таблицы будут заменены. Продолжить?",
			РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбораСКорзиной", ПараметрыФормы, Элементы.СписокНоменклатуры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИзКорзины(Адрес)
	
	Корзина = ПолучитьИзВременногоХранилища(Адрес);
	Объект.СписокНоменклатуры.Загрузить(Корзина);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка)
	Строка.Сумма = Строка.Количество * Строка.Цена;
КонецПроцедуры

#КонецОбласти
